let keyboardLayouts = {
  'eng': {
    label: 'English',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k'],
      ['l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v'],
      ['w', 'x', 'y', 'z', ',', '.', '-', '?', '!', '_', '@'],
      [7, 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'srp': {
    label: 'Srpski',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'č', 'ć', 'd', 'đ', 'e', 'f', 'g', 'h'],
      ['i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 'š'],
      ['t', 'u', 'v', 'z', 'ž', ',', '.', '-', '?', '!', '_'],
      ['@', 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'mac': {
    label: 'Македонски',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['а', 'б', 'в', 'г', 'д', 'ѓ', 'е', 'ж', 'з', 'ѕ', 'и'],
      ['ј', 'к', 'л', 'љ', 'м', 'н', 'њ', 'о', 'п', 'р', 'с'],
      ['т', 'ќ', 'у', 'ф', 'х', 'ц', 'ч', 'џ', 'ш', ',', '.'],
      ['-', '?', '!', '_', '@', 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'bos': {
    label: 'Bosanski',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'č', 'ć', 'd', 'đ', 'e', 'f', 'g', 'h'],
      ['i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 'š'],
      ['t', 'u', 'v', 'z', 'ž', ',', '.', '-', '?', '!', '_'],
      ['@', 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'mne': {
    label: 'Crnogorski',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'č', 'ć', 'd', 'đ', 'e', 'f', 'g', 'h'],
      ['i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 'š'],
      ['t', 'u', 'v', 'z', 'ž', ',', '.', '-', '?', '!', '_'],
      ['@', 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'hrv': {
    label: 'Hrvatski',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'č', 'ć', 'd', 'đ', 'e', 'f', 'g', 'h'],
      ['i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 'š'],
      ['t', 'u', 'v', 'z', 'ž', ',', '.', '-', '?', '!', '_'],
      ['@', 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  },
  'slv': {
    label: 'Slovenščina',
    keys: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'BACKSPACE'],
      ['a', 'b', 'c', 'č', 'ć', 'd', 'đ', 'e', 'f', 'g', 'h'],
      ['i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 'š'],
      ['t', 'u', 'v', 'z', 'ž', ',', '.', '-', '?', '!', '_'],
      ['@', 7, 7, 7, 7, 7, 'CAPSLOCK', 'SPACE', 'LEFT', 'RIGHT', 'LANGUAGE']
    ]
  }
}

export default keyboardLayouts
